       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTETOTAL.
       AUTHOR. Michael Daly
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LINK-PARAMETERS.
           05  LS-QUANTITY         PIC 9(3).
           05  LS-UNIT-PRICE       PIC 9(2)V99.
           05  LS-VALUE            PIC 9(5)V99.
       PROCEDURE DIVISION USING LINK-PARAMETERS.
       100-COMPUTE-VALUE.
           COMPUTE LS-VALUE = LS-QUANTITY * LS-UNIT-PRICE.
           EXIT PROGRAM.
