       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILECONVERSION.
       AUTHOR. MICHAEL DALY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT INVENT-IN
           ASSIGN TO "/home/mike/project4/INVENT4.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT INVENT-OUT
           ASSIGN TO "/home/mike/project4/INVENT6"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS PART-NUMBER-OUT
           FILE STATUS IS INVENT-STATUS.

       SELECT SUPPLIER-IN
           ASSIGN TO "/home/mike/project4/SUPPLIERS4.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT SUPPLIER-OUT
           ASSIGN TO "/home/mike/project4/SUPPLIER"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS SUPPLIER-CDE-OUT
           FILE STATUS IS SUPPLIER-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  INVENT-IN
           DATA RECORD IS INVENT-RECORD-IN.
       01  INVENT-RECORD-IN.
           05  PART-NUMBER-IN      PIC 9(5).
           05  PART-NAME-IN        PIC X(20).
           05  QUANTITY-IN         PIC 9(3).
           05  UNIT-PRICE-IN       PIC 9(2)V99.
           05  SUPPLIER-CODE-IN    PIC X(5).
           05  REORDER-IN          PIC X(3).

       FD  INVENT-OUT
           DATA RECORD IS INVENT-RECORD-OUT.
       01  INVENT-RECORD-OUT.
           05  PART-NUMBER-OUT      PIC 9(5).
           05  PART-NAME-OUT        PIC X(20).
           05  QUANTITY-OUT         PIC 9(3).
           05  UNIT-PRICE-OUT       PIC 9(2)V99.
           05  SUPPLIER-CODE-OUT    PIC X(5).
           05  REORDER-OUT          PIC X(3).

       FD  SUPPLIER-IN
           DATA RECORD IS SUPPLIER-IN.
       01  SUPPLIER-RECORD-IN.
           05  SUPPLIER-CODE      PIC X(5).
           05  SUPPLIER-NAME      PIC X(15).

       FD  SUPPLIER-OUT
           DATA RECORD IS SUPPLIER-RECORD-OUT.
       01  SUPPLIER-RECORD-OUT.
           05  SUPPLIER-CDE-OUT    PIC X(5).
           05  SUPPLIER-NME-OUT    PIC X(15).

       WORKING-STORAGE SECTION.
       01  OTHER-FIELDS.
           05  EOF              PIC X(1) VALUE "N".
           05  INVENT-STATUS    PIC X(2).
           05  SUPPLIER-STATUS  PIC X(2).

       PROCEDURE DIVISION.
       100-CONVERT-FILES.
           PERFORM 200-CONVERT-INVENTORY.
           PERFORM 200-CONVERT-SUPPLIER.
           STOP RUN.

       200-CONVERT-INVENTORY.
           PERFORM 300-INITIATE-INVENT-CONVERT.
           PERFORM 300-START-INVENT-CONVERT UNTIL EOF="Y".
           PERFORM 300-TERMINATE-INVENT-CONVERT.

       200-CONVERT-SUPPLIER.
           PERFORM 300-INITIATE-SUPPLIER-CONVERT.
           PERFORM 300-START-SUPPLIER-CONVERT UNTIL EOF="Y".
           PERFORM 300-TERMINATE-SUPPLIER-CONVERT.

       300-INITIATE-INVENT-CONVERT.
           PERFORM 400-OPEN-INVENT-FILES.
           PERFORM 400-INITIALIZE-OTHER-FIELDS.
           PERFORM 400-READ-INVENT-IN.

       300-START-INVENT-CONVERT.
           PERFORM 400-WRITE-INVENT-RECORD.
           PERFORM 400-READ-INVENT-IN.

       300-TERMINATE-INVENT-CONVERT.
           PERFORM 400-CLOSE-INVENT-FILES.
           PERFORM 400-DISPLAY-INVENT-FINISH.

       300-INITIATE-SUPPLIER-CONVERT.
           PERFORM 400-OPEN-SUPPLIER-FILES.
           PERFORM 400-INITIALIZE-OTHER-FIELDS.
           PERFORM 400-READ-SUPPLIER-IN.

       300-START-SUPPLIER-CONVERT.
           PERFORM 400-WRITE-SUPPLIER-RECORD.
           PERFORM 400-READ-SUPPLIER-IN.

       300-TERMINATE-SUPPLIER-CONVERT.
           PERFORM 400-CLOSE-SUPPLIER-FILES.
           PERFORM 400-DISPLAY-SUPPLIER-FINISH.

       400-OPEN-INVENT-FILES.
           OPEN INPUT INVENT-IN
                OUTPUT INVENT-OUT.

       400-OPEN-SUPPLIER-FILES.
           OPEN INPUT SUPPLIER-IN
                OUTPUT SUPPLIER-OUT.

       400-INITIALIZE-OTHER-FIELDS.
           INITIALIZE OTHER-FIELDS.

       400-READ-INVENT-IN.
           READ INVENT-IN
                AT END MOVE "Y" TO EOF.

       400-READ-SUPPLIER-IN.
           READ SUPPLIER-IN
                AT END MOVE "Y" TO EOF.

       400-WRITE-INVENT-RECORD.
           WRITE INVENT-RECORD-OUT FROM INVENT-RECORD-IN
               INVALID KEY DISPLAY "ERROR: " INVENT-STATUS.

       400-WRITE-SUPPLIER-RECORD.
           WRITE SUPPLIER-RECORD-OUT FROM SUPPLIER-RECORD-IN
               INVALID KEY DISPLAY "ERROR: " SUPPLIER-STATUS.

       400-CLOSE-INVENT-FILES.
           CLOSE INVENT-IN
                 INVENT-OUT.

       400-CLOSE-SUPPLIER-FILES.
           CLOSE SUPPLIER-IN
                 SUPPLIER-OUT.

       400-DISPLAY-INVENT-FINISH.
           DISPLAY "INVENTORY CONVERSION COMPLETED".

       400-DISPLAY-SUPPLIER-FINISH.
           DISPLAY "SUPPLIER CONVERSION COMPLETED".
