       01  INVENTORY-RECORD.
           05  PART-NUMBER-IN       PIC 9(5).
           05  PART-NAME-IN         PIC X(20).
           05  QUANTITY-IN          PIC 9(3).
           05  UNIT-PRICE-IN        PIC 9(2)V99.
           05  SUPPLIER-NUMBER-IN   PIC X(5).
           05  REORDER-IN           PIC 9(3).
